bench-runs/read-n10000-c200-2026-08-29-18-57-05-lru.txt

Summary:
  Total:	0.1578 secs
  Slowest:	0.0240 secs
  Fastest:	0.0001 secs
  Average:	0.0030 secs
  Requests/sec:	63369.8835
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [5793]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [2833]	|■■■■■■■■■■■■■■■■■■■■
  0.007 [981]	|■■■■■■■
  0.010 [145]	|■
  0.012 [68]	|
  0.014 [46]	|
  0.017 [56]	|
  0.019 [49]	|
  0.022 [27]	|
  0.024 [1]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0018 secs
  50%% in 0.0023 secs
  75%% in 0.0035 secs
  90%% in 0.0054 secs
  95%% in 0.0065 secs
  99%% in 0.0158 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0111 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0027 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0040 secs
  resp wait:	0.0024 secs, 0.0000 secs, 0.0107 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [302]	10000 responses