bench-runs/read-n10000-c225-2026-08-29-17-06-13.txt

Summary:
  Total:	0.3207 secs
  Slowest:	0.0625 secs
  Fastest:	0.0003 secs
  Average:	0.0070 secs
  Requests/sec:	30867.6739
  
  Total data:	415800 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [5883]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [3452]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [321]	|■■
  0.025 [51]	|
  0.031 [93]	|■
  0.038 [44]	|
  0.044 [43]	|
  0.050 [3]	|
  0.056 [5]	|
  0.062 [4]	|


Latency distribution:
  10%% in 0.0037 secs
  25%% in 0.0050 secs
  50%% in 0.0061 secs
  75%% in 0.0074 secs
  90%% in 0.0100 secs
  95%% in 0.0138 secs
  99%% in 0.0320 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0110 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0036 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0059 secs
  resp wait:	0.0061 secs, 0.0003 secs, 0.0624 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0085 secs

Status code distribution:
  [302]	9900 responses