bench-runs/read-n10000-c25-2026-08-28-18-15-39.txt

Summary:
  Total:	0.5593 secs
  Slowest:	0.0173 secs
  Fastest:	0.0002 secs
  Average:	0.0014 secs
  Requests/sec:	17878.7197
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [9134]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [750]	|■■■
  0.005 [31]	|
  0.007 [6]	|
  0.009 [2]	|
  0.010 [37]	|
  0.012 [12]	|
  0.014 [7]	|
  0.016 [0]	|
  0.017 [20]	|


Latency distribution:
  10%% in 0.0009 secs
  25%% in 0.0010 secs
  50%% in 0.0012 secs
  75%% in 0.0015 secs
  90%% in 0.0018 secs
  95%% in 0.0021 secs
  99%% in 0.0040 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0042 secs
  resp wait:	0.0013 secs, 0.0002 secs, 0.0173 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0152 secs

Status code distribution:
  [302]	10000 responses