bench-runs/read-n10000-c25-2026-08-29-16-54-45.txt

Summary:
  Total:	0.4924 secs
  Slowest:	0.0228 secs
  Fastest:	0.0002 secs
  Average:	0.0012 secs
  Requests/sec:	20309.8470
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [9935]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [38]	|
  0.007 [1]	|
  0.009 [10]	|
  0.011 [0]	|
  0.014 [0]	|
  0.016 [0]	|
  0.018 [2]	|
  0.021 [8]	|
  0.023 [5]	|


Latency distribution:
  10%% in 0.0008 secs
  25%% in 0.0009 secs
  50%% in 0.0011 secs
  75%% in 0.0014 secs
  90%% in 0.0016 secs
  95%% in 0.0018 secs
  99%% in 0.0023 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0029 secs
  resp wait:	0.0011 secs, 0.0002 secs, 0.0204 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [302]	10000 responses