bench-runs/read-n10000-c250-2026-08-29-17-06-44.txt

Summary:
  Total:	0.3213 secs
  Slowest:	0.0640 secs
  Fastest:	0.0002 secs
  Average:	0.0076 secs
  Requests/sec:	31124.0328
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [4883]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [4409]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [274]	|■■
  0.026 [192]	|■■
  0.032 [130]	|■
  0.038 [38]	|
  0.045 [51]	|
  0.051 [7]	|
  0.058 [1]	|
  0.064 [14]	|


Latency distribution:
  10%% in 0.0039 secs
  25%% in 0.0054 secs
  50%% in 0.0066 secs
  75%% in 0.0079 secs
  90%% in 0.0109 secs
  95%% in 0.0160 secs
  99%% in 0.0374 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0097 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0061 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0107 secs
  resp wait:	0.0066 secs, 0.0002 secs, 0.0637 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0117 secs

Status code distribution:
  [302]	10000 responses