bench-runs/read-n10000-c275-2026-08-29-17-06-58.txt

Summary:
  Total:	0.3446 secs
  Slowest:	0.0501 secs
  Fastest:	0.0003 secs
  Average:	0.0092 secs
  Requests/sec:	28729.2598
  
  Total data:	415800 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [979]	|■■■■■■
  0.010 [7009]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [1452]	|■■■■■■■■
  0.020 [85]	|
  0.025 [83]	|
  0.030 [113]	|■
  0.035 [43]	|
  0.040 [57]	|
  0.045 [66]	|
  0.050 [12]	|


Latency distribution:
  10%% in 0.0053 secs
  25%% in 0.0072 secs
  50%% in 0.0085 secs
  75%% in 0.0098 secs
  90%% in 0.0118 secs
  95%% in 0.0148 secs
  99%% in 0.0394 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0126 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0070 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0059 secs
  resp wait:	0.0083 secs, 0.0003 secs, 0.0447 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [302]	9900 responses