bench-runs/write-n10000-c10-2026-08-28-18-12-38.txt

Summary:
  Total:	0.9670 secs
  Slowest:	0.0113 secs
  Fastest:	0.0002 secs
  Average:	0.0010 secs
  Requests/sec:	10341.4791
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [9765]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [224]	|■
  0.004 [0]	|
  0.005 [0]	|
  0.006 [0]	|
  0.007 [0]	|
  0.008 [0]	|
  0.009 [0]	|
  0.010 [0]	|
  0.011 [10]	|


Latency distribution:
  10%% in 0.0008 secs
  25%% in 0.0009 secs
  50%% in 0.0009 secs
  75%% in 0.0010 secs
  90%% in 0.0012 secs
  95%% in 0.0012 secs
  99%% in 0.0014 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0056 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0009 secs, 0.0002 secs, 0.0046 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	10000 responses