bench-runs/write-n10000-c100-2026-08-28-18-12-48.txt

Summary:
  Total:	0.8323 secs
  Slowest:	0.0224 secs
  Fastest:	0.0028 secs
  Average:	0.0083 secs
  Requests/sec:	12015.3358
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.003 [1]	|
  0.005 [5]	|
  0.007 [14]	|
  0.009 [8281]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [1609]	|■■■■■■■■
  0.013 [14]	|
  0.015 [12]	|
  0.016 [15]	|
  0.018 [18]	|
  0.020 [15]	|
  0.022 [16]	|


Latency distribution:
  10%% in 0.0076 secs
  25%% in 0.0079 secs
  50%% in 0.0082 secs
  75%% in 0.0085 secs
  90%% in 0.0089 secs
  95%% in 0.0092 secs
  99%% in 0.0104 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0069 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0029 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0082 secs, 0.0027 secs, 0.0163 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	10000 responses