bench-runs/write-n10000-c100-2026-08-28-18-36-06.txt

Summary:
  Total:	0.8451 secs
  Slowest:	0.0248 secs
  Fastest:	0.0031 secs
  Average:	0.0084 secs
  Requests/sec:	11833.5388
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.003 [1]	|
  0.005 [8]	|
  0.007 [409]	|■■
  0.010 [9270]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [212]	|■
  0.014 [12]	|
  0.016 [17]	|
  0.018 [25]	|
  0.020 [24]	|
  0.023 [18]	|
  0.025 [4]	|


Latency distribution:
  10%% in 0.0076 secs
  25%% in 0.0079 secs
  50%% in 0.0083 secs
  75%% in 0.0086 secs
  90%% in 0.0090 secs
  95%% in 0.0093 secs
  99%% in 0.0119 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0092 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0028 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.0083 secs, 0.0031 secs, 0.0146 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	10000 responses