bench-runs/write-n10000-c100-2026-08-29-12-14-51.txt

Summary:
  Total:	0.7795 secs
  Slowest:	0.0467 secs
  Fastest:	0.0022 secs
  Average:	0.0077 secs
  Requests/sec:	12829.3522
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.007 [1346]	|■■■■■■
  0.011 [8320]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [230]	|■
  0.020 [3]	|
  0.024 [0]	|
  0.029 [2]	|
  0.033 [3]	|
  0.038 [20]	|
  0.042 [25]	|
  0.047 [50]	|


Latency distribution:
  10%% in 0.0065 secs
  25%% in 0.0068 secs
  50%% in 0.0072 secs
  75%% in 0.0077 secs
  90%% in 0.0083 secs
  95%% in 0.0096 secs
  99%% in 0.0265 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0094 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0030 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.0076 secs, 0.0022 secs, 0.0366 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [201]	10000 responses