bench-runs/write-n10000-c100-2026-08-29-12-37-37.txt

Summary:
  Total:	0.8346 secs
  Slowest:	0.0591 secs
  Fastest:	0.0011 secs
  Average:	0.0083 secs
  Requests/sec:	11982.4284
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.007 [3019]	|■■■■■■■■■■■■■■■■■■
  0.013 [6652]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [113]	|■
  0.024 [21]	|
  0.030 [42]	|
  0.036 [54]	|
  0.042 [8]	|
  0.048 [8]	|
  0.053 [41]	|
  0.059 [41]	|


Latency distribution:
  10%% in 0.0063 secs
  25%% in 0.0067 secs
  50%% in 0.0073 secs
  75%% in 0.0082 secs
  90%% in 0.0095 secs
  95%% in 0.0105 secs
  99%% in 0.0354 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0101 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0028 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0082 secs, 0.0010 secs, 0.0590 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [201]	10000 responses