bench-runs/write-n10000-c100-2026-08-29-12-38-27.txt

Summary:
  Total:	0.7023 secs
  Slowest:	0.0268 secs
  Fastest:	0.0009 secs
  Average:	0.0070 secs
  Requests/sec:	14239.8923
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.003 [4]	|
  0.006 [602]	|■■■
  0.009 [9288]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [5]	|
  0.014 [0]	|
  0.016 [0]	|
  0.019 [24]	|
  0.022 [32]	|
  0.024 [31]	|
  0.027 [13]	|


Latency distribution:
  10%% in 0.0062 secs
  25%% in 0.0065 secs
  50%% in 0.0068 secs
  75%% in 0.0072 secs
  90%% in 0.0075 secs
  95%% in 0.0078 secs
  99%% in 0.0164 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0089 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0030 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0069 secs, 0.0009 secs, 0.0177 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [201]	10000 responses