bench-runs/write-n10000-c100-2026-08-29-12-38-57.txt

Summary:
  Total:	0.6657 secs
  Slowest:	0.0188 secs
  Fastest:	0.0012 secs
  Average:	0.0066 secs
  Requests/sec:	15022.5846
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.003 [3]	|
  0.005 [11]	|
  0.006 [4674]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [5203]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [8]	|
  0.012 [19]	|
  0.014 [21]	|
  0.015 [26]	|
  0.017 [27]	|
  0.019 [7]	|


Latency distribution:
  10%% in 0.0060 secs
  25%% in 0.0062 secs
  50%% in 0.0065 secs
  75%% in 0.0069 secs
  90%% in 0.0072 secs
  95%% in 0.0074 secs
  99%% in 0.0107 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0065 secs, 0.0010 secs, 0.0130 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [201]	10000 responses