bench-runs/write-n10000-c100-2026-08-29-12-38-58.txt

Summary:
  Total:	0.6752 secs
  Slowest:	0.0193 secs
  Fastest:	0.0017 secs
  Average:	0.0067 secs
  Requests/sec:	14810.8853
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.003 [6]	|
  0.005 [20]	|
  0.007 [7583]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [2282]	|■■■■■■■■■■■■
  0.011 [29]	|
  0.012 [13]	|
  0.014 [16]	|
  0.016 [12]	|
  0.018 [19]	|
  0.019 [19]	|


Latency distribution:
  10%% in 0.0060 secs
  25%% in 0.0063 secs
  50%% in 0.0066 secs
  75%% in 0.0070 secs
  90%% in 0.0074 secs
  95%% in 0.0076 secs
  99%% in 0.0089 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0058 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.0066 secs, 0.0017 secs, 0.0136 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [201]	10000 responses