bench-runs/write-n10000-c100-2026-08-29-12-49-04.txt

Summary:
  Total:	0.5141 secs
  Slowest:	0.0918 secs
  Fastest:	0.0003 secs
  Average:	0.0050 secs
  Requests/sec:	19450.1617
  
  Total data:	190000 bytes
  Size/request:	19 bytes

Response time histogram:
  0.000 [1]	|
  0.009 [9789]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [111]	|
  0.028 [15]	|
  0.037 [10]	|
  0.046 [0]	|
  0.055 [13]	|
  0.064 [7]	|
  0.073 [23]	|
  0.083 [14]	|
  0.092 [17]	|


Latency distribution:
  10%% in 0.0026 secs
  25%% in 0.0034 secs
  50%% in 0.0043 secs
  75%% in 0.0053 secs
  90%% in 0.0064 secs
  95%% in 0.0074 secs
  99%% in 0.0170 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0087 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	0.0048 secs, 0.0002 secs, 0.0848 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [201]	10000 responses